SPedt/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt/src/AccumulationRegisters/УпакованныеЗаказы/УпакованныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УпакованныеЗаказы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.УпаковатьЗаказы</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.ЗаказыДляТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt/src/AccumulationRegisters/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Расход</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияДляОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Списано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасхода</name>
    <type>
      <types>EnumRef.ТипРасхода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БесплатнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредоплаченоУчастником</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>пристрой</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SPedt/src/Documents/РазборКоробки/РазборКоробки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазборКоробки</name>
  <registerRecords>InformationRegister.УдалитьПокупкиОтдельнымМестом</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказовСайт</registerRecords>
  <registerRecords>InformationRegister.ШтрафныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказов</registerRecords>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>InformationRegister.УдалитьНегабаритЗначения</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.Приход</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОборотнаяТараДвижение</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоробка</name>
    <type>
      <types>CatalogRef.Коробки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелаемГрупповойСтикер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеКоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеОрги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитываемНеСоответствиеВКоробках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СинхронизацияМобильноеПриложение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Коробки</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКРазбору</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>ОборотнаяТара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ТараЗаполнена</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Посылки</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БылОтправлен</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыНаТранзит</name>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОборотнаяТара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотнаяТара</name>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/CommonModules/СП_ДвиженияСервер/Module.bsl
#Область ПрограммныйИнтерфейс
Процедура ОтразитьДвиженияДанныеЗаказов(ДвиженияДанныеЗаказов, Ссылка) Экспорт
	Запрос = Новый Запрос;     
	Запрос.текст  ="ВЫБРАТЬ
		              |	Посылки.Ссылка.Дата КАК Период,
		              |	Посылки.Ссылка КАК Партия,
		              |	Посылки.Посылка КАК Заказ,
		              |	Посылки.Габарит КАК Габарит,
		              |	Посылки.Вес КАК Вес,
		              |	Посылки.объем КАК Объем,
		              |	1 КАК Количество,
		              |	Посылки.ОтдельнымМестом КАК ОтдельнымМестом,
		              |	Посылки.ДатаПриема КАК ДатаПриема,
		              |	НЕ Посылки.Оплачен КАК НеОплачен,
		              |	Посылки.Коробка КАК Коробка,
		              |	Посылки.МестоХранения КАК МестоХранения
		              |ИЗ
		              |	Документ.РазборКоробки.Посылки КАК Посылки
		              |ГДЕ
		              |	Посылки.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Группы.Ссылка.Дата,
		              |	Группы.Ссылка,
		              |	Группы.Коробка,
		              |	Группы.Габарит,
		              |	Группы.Вес,
		              |	Группы.объем,
		              |	Группы.Количество,
		              |	Группы.ОтдельнымМестом,
		              |	Группы.ДатаПриема,
		              |	ЛОЖЬ,
		              |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки),
		              |	Группы.МестоХранения
		              |ИЗ
		              |	Документ.РазборКоробки.ГруппыНаТранзит КАК Группы
		              |ГДЕ
		              |	Группы.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Посылки.Ссылка.Дата КАК Период,
		              |	Посылки.Ссылка КАК Партия,
		              |	Посылки.Посылка КАК Заказ,
		              |	Посылки.Габарит КАК Габарит,
		              |	Посылки.Вес КАК Вес,
		              |	Посылки.объем КАК Объем,
		              |	1 КАК Количество,
		              |	Посылки.ОтдельнымМестом КАК ОтдельнымМестом,
		              |	Посылки.ДатаПриема КАК ДатаПриема,
		              |	НЕ Посылки.Оплачен КАК НеОплачен,
		              |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки) КАК Коробка,
		              |	Посылки.МестоХранения КАК МестоХранения
		              |ИЗ
		              |	Документ.Приходная.Посылки КАК Посылки
		              |ГДЕ
		              |	Посылки.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Покупки.Ссылка.Дата,
		              |	Покупки.Ссылка,
		              |	Покупки.Покупка,
		              |	Покупки.Габарит,
		              |	Покупки.Вес,
		              |	Покупки.объем,
		              |	1,
		              |	Покупки.ОтдельнымМестом,
		              |	Покупки.ДатаПриема,
		              |	НЕ Покупки.Оплачен,
		              |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки),
		              |	Покупки.МестоХранения
		              |ИЗ
		              |	Документ.Приходная.Покупки КАК Покупки
		              |ГДЕ
		              |	ТИПЗНАЧЕНИЯ(Покупки.Покупка) = ТИП(Справочник.Коробки)
		              |	И Покупки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();        
	выборка = Результат.Выбрать();
	ДвиженияДанныеЗаказов.записывать = Истина;
	Пока Выборка.Следующий() Цикл
		движение = ДвиженияДанныеЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ВЫборка);
	КонецЦикла;		
	
КонецПроцедуры	


Процедура ОтразитьДвиженияПоРегистру(НазваниеРегистра, ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений["Таблица"+НазваниеРегистра];
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистра = Движения[НазваниеРегистра];
	ДвиженияРегистра.Записывать = Истина;
	ДвиженияРегистра.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры




// Процедура формирования движений по регистру "НеВыгруженноНаСайт ".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Структура дополнительных свойств для проведения.
//  Движения - Структура - Структура наборов движений документа.
//  Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьНеВыгруженноНаСайт(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаНеВыгруженноНаСайт = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНеВыгруженноНаСайт;
	
	Если Отказ ИЛИ ТаблицаНеВыгруженноНаСайт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНеВыгруженноНаСайт = Движения.НеВыгруженноНаСайт;
	ДвиженияНеВыгруженноНаСайт.Записывать = Истина;
	ДвиженияНеВыгруженноНаСайт.Загрузить(ТаблицаНеВыгруженноНаСайт);
	
КонецПроцедуры

Процедура ОтразитьТранзит(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаТранзит = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТранзит;
	
	Если Отказ ИЛИ ТаблицаТранзит.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТранзит = Движения.Транзит;
	ДвиженияТранзит.Записывать = Истина;
	ДвиженияТранзит.Загрузить(ТаблицаТранзит);
	
КонецПроцедуры




Процедура ОтразитьОстаткиТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаОстаткиТоваров = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоваров;
	
	Если Отказ ИЛИ ТаблицаОстаткиТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОстаткиТоваров = Движения.ОстаткиТоваров;
	ДвиженияОстаткиТоваров.Записывать = Истина;
	ДвиженияОстаткиТоваров.Загрузить(ТаблицаОстаткиТоваров);
	
КонецПроцедуры


Процедура ПроверитьОтрицательныеОстаткиНаСкладе(Ссылка, СписокНоменклатуры, Отказ) Экспорт
	//Если Не Константы.КонтралироватьОстаткиПриРасходе.Получить() Тогда
	//	Возврат ;	
	//КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Покупка КАК Покупка,
		|	ОстаткиТоваровОстатки.Габарит КАК Габарит,
		|	ОстаткиТоваровОстатки.МестоХранения КАК МестоХранения,
		|	ОстаткиТоваровОстатки.Участник КАК Участник
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&МоментВремени,
		|				Покупка В (&СписокНоменклатуры)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка= РезультатЗапроса.Выбрать();
		
		ТекстСообщениея = "В результате проведения " +Ссылка+ " Возникает отрицательный остаток по следующим позициям :"+Символы.ПС;
		Пока Выборка.Следующий() Цикл
			ТекстСообщениея = ТекстСообщениея + Выборка.Покупка +" для "+ выборка.Участник + ", г: "+Выборка.Габарит + ", мх: " +Выборка.МестоХранения;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщениея);
	КонецЕсли;
	
	
	
КонецПроцедуры	

Процедура ОтразитьУпакованныеЗаказы(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаУпакованныеЗаказы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУпакованныеЗаказы;
	
	Если Отказ ИЛИ ТаблицаУпакованныеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУпакованныеЗаказы= Движения.УпакованныеЗаказы;
	ДвиженияУпакованныеЗаказы.Записывать = Истина;
	ДвиженияУпакованныеЗаказы.Загрузить(ТаблицаУпакованныеЗаказы);
	
КонецПроцедуры



Процедура ОтразитьЗаказыВПосылках(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаЗаказыВПосылках = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыВПосылках;
	
	Если Отказ ИЛИ ТаблицаЗаказыВПосылках.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыВПосылках = Движения.ЗаказыВПосылках;
	ДвиженияЗаказыВПосылках.Записывать = Истина;
	ДвиженияЗаказыВПосылках.Загрузить(ТаблицаЗаказыВПосылках);
	
КонецПроцедуры

Процедура ОтразитьПриход(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПриход = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПриход;
	
	Если Отказ ИЛИ ТаблицаПриход.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПриход = Движения.Приход;
	ДвиженияПриход.Записывать = Истина;
	ДвиженияПриход.Загрузить(ТаблицаПриход);
	
КонецПроцедуры

Процедура ОтразитьРасход(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица_Движений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасход;
	
	Если Отказ ИЛИ Таблица_Движений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПриход = Движения.Расход;
	ДвиженияПриход.Записывать = Истина;
	ДвиженияПриход.Загрузить(Таблица_Движений);
	
КонецПроцедуры


Процедура ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПродажи = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи;
	
	Если Отказ ИЛИ ТаблицаПродажи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПродажи = Движения.Продажи;
	ДвиженияПродажи.Записывать = Истина;
	ДвиженияПродажи.Загрузить(ТаблицаПродажи);
	
КонецПроцедуры

Процедура ОтразитьКПолучению(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаКПолучению = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКПолучению;
	
	Если Отказ ИЛИ ТаблицаКПолучению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияКПолучению = Движения.КПолучению;
	ДвиженияКПолучению.Записывать = Истина;
	ДвиженияКПолучению.Загрузить(ТаблицаКПолучению);
	
КонецПроцедуры


#КонецОбласти
